<details><summary>Terraform Plan</summary>
<p>

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_instance_profile.snyk will be created
  + resource "aws_iam_instance_profile" "snyk" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "bcda-test-snyk"
      + name_prefix = (known after apply)
      + path        = "/delegatedadmin/developer/"
      + role        = "bcda-test-snyk"
      + tags_all    = {
          + "business"  = "oeda"
          + "code"      = "https://github.com/CMSgov/ab2d-bcda-dpc-platform/tree/main/terraform/services/ecr-synk-integration"
          + "component" = "github-actions"
          + "terraform" = "true"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.snyk will be created
  + resource "aws_iam_role" "snyk" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "synk-integration",
                              + "arn:aws:iam::755619740999:role/ct-ado-bcda-application-admin",
                            ]
                        }
                    },
                  + {
                      + Action   = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SnykAllowPull"
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + sts:ExternalId = "f3cbda90-da90-411a-984c-4e275489ecd1"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::198361731867:user/ecr-integration-user"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bcda-test-snyk"
      + name_prefix           = (known after apply)
      + path                  = "/delegatedadmin/developer/"
      + permissions_boundary  = "arn:aws:iam::755619740999:policy/cms-cloud-admin/ct-ado-poweruser-permissions-boundary-policy"
      + tags_all              = {
          + "business"  = "oeda"
          + "code"      = "https://github.com/CMSgov/ab2d-bcda-dpc-platform/tree/main/terraform/services/ecr-synk-integration"
          + "component" = "github-actions"
          + "terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "snyk"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "*"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_ssm_parameter.snyk_integration_role_arn will be created
  + resource "aws_ssm_parameter" "snyk_integration_role_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/bcda-snyk/role-arn"
      + tags_all       = {
          + "business"  = "oeda"
          + "code"      = "https://github.com/CMSgov/ab2d-bcda-dpc-platform/tree/main/terraform/services/ecr-synk-integration"
          + "component" = "github-actions"
          + "terraform" = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + snyk_role_arn = (known after apply)

</p>
</details> 